Show / Hide Table of Contents
Enum TypeOfCalculationDeflection
Define type of support conditions
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum TypeOfCalculationDeflection
Fields
 Name |  Description
 BothOfThem
both calculation is done, it is for comparative results
 DirectCalculation
check of slenderness is not taken into account, directly calculation of deflection is done
 CheckSlenderness
check slenderness calculation, if rules are full filed no other calculation is done
 CheckSlendernessContinueDirectCalculation
if check of slenderness is not ok then, directly calculation of deflection is done
 Improve this Doc
 View Source